SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `ads`;
CREATE TABLE `ads` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `private` tinyint(4) NOT NULL,
  `seller_name` varchar(60) NOT NULL,
  `email` varchar(30) NOT NULL,
  `allow_mails` tinyint(4) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `location_id` mediumint(9) NOT NULL,
  `category_id` smallint(6) NOT NULL,
  `title` tinytext NOT NULL,
  `description` text NOT NULL,
  `price` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

DROP TABLE IF EXISTS `Categories`;
CREATE TABLE `Categories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(40) NOT NULL,
  `parent_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=1003 DEFAULT CHARSET=utf8	;
INSERT INTO `Categories` VALUES 
(101,'Автомобили с пробегом',100),
(102,'Запчасти и аксессуары',100),
(103,'Водный транспорт',100),
(104,'Мотоциклы и мототехника',100),
(105,'Грузовики и спецтехника',100),
(106,'Новые автомобили',100),
(201,'Комнаты',200),
(202,'Квартиры',200),
(203,'Дома, дачи, коттеджи',200),
(204,'Земельные участки',200),
(205,'Коммерческая недвижимость',200),
(206,'Гаражи и машиноместа',200),
(207,'Недвижимость за рубежом',200),
(301,'Вакансии (поиск сотрудников)',300),
(302,'Резюме (поиск работы)',300),
(401,'Предложения услуг',400),
(402,'Запросы на услуги',400),
(501,'Одежда, обувь, аксессуары',500),
(502,'Часы и украшения',500),
(503,'Детская одежда и обувь',500),
(504,'Товары для детей и игрушки',500),
(505,'Красота и здоровье',500),
(601,'Ремонт и строительство',600),
(602,'Мебель и интерьер',600),
(603,'Бытовая техника',600),
(604,'Продукты питания',600),
(605,'Посуда и товары для кухни',600),
(606,'Растения',600),
(701,'Настольные компьютеры',700),
(702,'Аудио и видео',700),
(703,'Телефоны',700),
(704,'Планшеты и электронные книги',700),
(705,'Игры, приставки и программы',700),
(706,'Ноутбуки',700),
(707,'Оргтехника и расходники',700),
(708,'Товары для компьютера',700),
(709,'Фототехника',700),
(801,'Билеты и путешествия',800),
(802,'Велосипеды',800),
(803,'Коллекционирование',800),
(804,'Музыкальные инструменты',800),
(805,'Спорт и отдых',800),
(806,'Книги и журналы',800),
(807,'Охота и рыбалка',800),
(808,'Знакомства',800),
(901,'Собаки',900),
(902,'Кошки',900),
(903,'Птицы',900),
(904,'Аквариум',900),
(905,'Другие животные',900),
(906,'Товары для животных',900),
(1001,'Оборудование для бизнеса',1000),
(1002,'Готовый бизнес',1000),
(100,'Транспорт',\N),
(200,'Недвижимость',\N),
(300,'Работа',\N),
(400,'Услуги',\N),
(500,'Личные вещи',\N),
(600,'Для дома и дачи',\N),
(700,'Бытовая электроника',\N),
(800,'Хобби и отдых',\N),
(900,'Животные',\N),
(1000,'Для бизнеса',\N)	;

DROP TABLE IF EXISTS `citys`;
CREATE TABLE `citys` (
  `id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

INSERT INTO `citys` (`id`, `name`) VALUES
(641780,	'Новосибирск'),
(641490,	'Барабинск'),
(641510,	'Бердск'),
(641600,	'Искитим'),
(641630,	'Колывань'),
(641680,	'Краснообск'),
(641710,	'Куйбышев'),
(641760,	'Мошково'),
(641790,	'Обь'),
(641800,	'Ордынское'),
(641970,	'Черепаново');
